#define _CRT_SECURE_NO_WARNINGS

#include<stdio.h>


//int main()
//{
//	double a = 5 / 2;//当变量的使用的数据类型为浮点数时 被除数与除数至少有一个要有小数点 变量的接收值才能为小数
//	printf("a=%lf\n",a);
//}

//int main()
//{
//	double a = 5%2;//在VS的一些旧版本中 取模时操作数与被操作数的数据必须都是整数
//	printf("a=%lf\n", a);
//}




//int main()
//{
//	//右移位操作符展示
//	// 有除二的效果
//	//移位操作符有两种 算数右移 逻辑右移
//	//算数右移是右边丢弃 左边补原符号
//	//逻辑右移是右边丢弃 左边补零
//	int c = 16;
//	int d = c >> 1;
//	printf("%d \n", d);
//	//正整数的原码、反码、补码是一致的，
//	//16的源码为
//	//00000000000000000000000000001000
//	//移位后为
//	//00000000000000000000000000000100
//
//	int a = -1;
//	int b = a >> 1;
//	printf("%d \n",b);
//	//原码为
//	//10000000000000000000000000000001（）最前面的1代表是负数
//	//反码为
//	//11111111111111111111111111111110
//	//补码为
//	//11111111111111111111111111111111
//	//而补码打印的结果为-1
//
//	//左移操作符 左边丢弃 右边补零
//	//有乘二的效果
//	int e = 5;
//	int f = e << 1;
//	printf("%d \n", f);
//
//	//移位操作符不可以移动负数位 
//	int g = 5;
//	int h = g << -1;//error
//}

//位操作符
//int main()
//{
//	//&按位与 将数字转化成二进制与
//	/*int a = 3, b = 5;
//	int c = a & b;*/
//	//00000000000000000000000000000011---3
//	//00000000000000000000000000000101---5
//	//00000000000000000000000000000001---按位与后
//	/*printf("%d",c);*/
//
//	// | 按位或 将数字转化成二进制与
//	/*int a = 3, b = 5;
//	int c = a | b;*/
//	//00000000000000000000000000000011---3
//	//00000000000000000000000000000101---5
//	//00000000000000000000000000000111---按位或后
//	/*printf("%d", c);*/
//
//	//按位异或 将数字转化成二进制异或
//	//相同为0 相异为1
//	int a = 3, b = 5;
//	int c = a ^ b;
//	//00000000000000000000000000000011---3
//	//00000000000000000000000000000101---5
//	//00000000000000000000000000000110---按位异或后
//	printf("%d", c);
//}

//不创建临时变量交换两个数值
//int main()
//{
//	//第一种方式 容易溢出
//	/*int a = 3, b = 5;
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("%d %d",a,b);*/
//
//	//第二种方式
//	int a = 3, b = 5;
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("%d %d", a, b);
//
//
//
//}

//求一个数值二进制时的1的个数
//int main()
//{
//	int input = 0;
//	int count = 0;
//	scanf("%d",&input);
//	while (input)
//	{
//		if (input % 2 == 1)//遇到%之后为0的数 会进入死循环
//		{
//			count++;
//			input = input / 2;
//
//		}
//	}
//	printf("%d", count);
//}

//int main()
//{
//	int input = 0;
//	int count = 0;
//	scanf("%d", &input);
//
//	int i = 0;
//	for (i=0;i<32;i++)
//	{
//		if (1 == ((input>> i) & 1))
//		{
//			count++;
//		}
//	}
//	printf("%d \n",count);
//
//}

//使用sizeof计算大小

//int main()
//{
//	int a = 10;
//	char c = 'r';
//	char* p = &c;
//	int arr[10] = {0};
//	//sizeof用于计算变量所占内存空间的大小，单位是字节（8bit）
//	printf("%d\n",sizeof(a));//整形占4字节
//	printf("%d\n",sizeof(c));//字符占1字节
//	printf("%d\n",sizeof(arr));//数组的大小是每个元素所占内存空间大小之和 arr中是整形元素 一个元素是4字节 所以arr大小是40
//
//	//对于数组来说 去掉数组名剩下的就是它的类型 如int[10] char[8]
//	// 所以可以通过数组的类型计算一个数组的大小	也可以通过变量名计算一个数组的大小
//	printf("%d\n",sizeof(int[10]));
//
//	//sizeof后面为变量时括号可以省略掉 但后面是类型时不可省略
//	printf("%d\n",sizeof a);//和sizeof（a）时没有变化
//	printf("%d\n"sizeof int);//会报错
//}

//面试的一个题目
//int main()
//{
//	short s = 0;
//	int a = 10;
//	printf("%d\n",sizeof(s=a+5));//2
//	printf("%d\n",s);//0
//}

//按位取反符号以及使用 ~按二进制位取反
//int main()
//{
//	int a = 0;
//	//00000000000000000000000000000000-原码
//	//原码取反加一可以取得补码
//	//11111111111111111111111111111111-补码
//	//补码减一取反得到原码
//	//11111111111111111111111111111110-反码
//	//10000000000000000000000000000001-原码 按位取反时符号位不变 其他位取反	
//	//-1
//	printf("%d",~a);
//}

//int main()
//{ 
//	int a = 10;
//	//printf("%d\n",++a);//++在前面时 先++ 再使用
//	printf("%d\n", a++);//先使用 后++
//}

//强制转换操作符
//int main()
//{
//	//int a = 3.14;//3.14是double类型 使用int变量存储会丢失数据 在老版本中会报错
//	int a = (int)3.14;//int(3.14)是错误写法
//	printf("%d",a);
//}

//  &&--逻辑与的运算 与||--逻辑或运算
//int main()
//{
//	int a = 3;
//	int b = 2;
//	int d = 0;
//	int c = a && b;
//	int e = a && d;
//	printf("%d\n",c);//当两个数都不等于0时 输出1
//	printf("%d\n",e);//有0（假）时输出0（假）
//
//	int f = a && b;
//	int g = a || d;
//	printf("%d\n",f);
//	printf("%d\n",g);
//}

//&&的使用注意事项  当&&前为假（0）时 后面的变量的运算不再进行
//int main()
//{
//	/*int i = 0, a = 0, b = 2, c = 3, d = 4;
//	 i = a++ && ++b && d++;
//	printf("a=%d\nb=%d\nc=%d\nd=%d\n",a,b,c,d);*/
//	/*输出结果为 
//	a = 1
//	b = 2
//	c = 3
//	d = 4*/
//	//a++&&++b&c++......中只要&&前面的数字为假（0）后面便不在计算 
//
//
//	/*int i = 0, a = 1, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	printf("a=%d\nb=%d\nc=%d\nd=%d\n", a, b, c, d);*/
//	/*结果为
//		a=2
//		b = 3
//		c = 3
//		d = 5*/
//}

//逻辑或--|| 当||前为真（非零）后面的变量不再运算
//int main()
//{
//	int i = 0, a = 1, b = 2, c = 3, d = 4;
//	i = a++ || ++b || d++;
//	printf("a=%d\nb=%d\nc=%d\nd=%d\n", a, b, c, d);
//	//输出结果a=2  b = 2  c = 3  d = 4
//} 

//条件操作符 exp1? exp2: exp3 表达式1的结果为真 计算表达式2 表达式1为假 计算表达式3
//int main()
//{
//	int a = 10;
//	int b = 5;
//	int max = 0;
//	if (a>b)
//	{
//		max = a;
//	}
//	else
//	{
//		max = b;
//	}
//	//可以等效替换为
//	max=(a > b ? a : b);
//}

//逗号表达式:从左到右依次计算 整个表达式的结果是最后一个表达式的结果
//int main()
//{
//	int a = 3;
//	int b = 4;
//	int c = (a > b, a=b+10, b = a + 1);
//	printf("%d\n",c);
//
//	//逗号表达式在判断中的作用
//	if (a = b + 1, c = a / 2, d < 0)
//	{
//		//执行的命令
//	}
//
//}

//下标引用操作符--[]
//int main()
//{
//	int a[10];//创建数组变量
//	a[8] = 9;//使用下标引用操作符
//	printf("%d",a[8]);
//
//
//}

//函数调用操作符
//int get_max(int a,int b)//不是函数调用操作符 是语法结构
//{
//	return a > b ? a: b;
//}
//int main()
//{
//	int a = 3, b = 4;
//	//调用函数的（）就是函数调用操作符
//	int max = get_max(a,b);//三个操作数 get_max  a  b
//	printf("%d",max);
//}


//struct Stu//结构体就是一个类型 类似于int float
//{
//	char name[20];
//	int age;
//	char id[20];
//};//注意;

//访问结构体成员
// 两种方式
//结构体.成员
//结构体指针->成员
//int main()
//{
//	//使用struct Stu这个类型创建一个学生对象s1，并初始化
//	struct Stu s1 = {"梅德",20,"85213749"};
//	//进行打印
//	//打印方式为：结构体变量.成员名
//	printf("%s\n",s1.name);
//	printf("%d\n",s1.age);
//	printf("%s\n",s1.id);
//	//使用指针打印
//	struct Stu* ps = &s1;
//	printf("%s\n",(*ps).name);
//	printf("%d\n", (*ps).age);
//	printf("%s\n", (*ps).id);
//	//结构体指针方式打印   ->
//	printf("%s\n",ps->name);
//	printf("%d\n", ps->age);
//	printf("%s\n", ps->id);
//}

//表达式求值 
//表达式求值的顺序一般是由操作符的优先级和结合性决定
//但是有些表达式的操作数在求值的过程中可能需要转换为其他类型

//隐式类型转换
//表达式中的字符和短整型操作数在使用前被转换为普通类型（整形提升）
//整形提升——按照数据类型的符号位来提升(数据的第一位为符号位，就是说看前面第一个数，如果是1就补1，是0就补0)
//int main()
//{
//	//总结：
//	//char进行数组运算的最大值不超过128，因为128的二进制为10000000
//	//10000000在整形提升时会根据符号位（第一位）补1
//	//整形提升后的结果为：11111111111111111111111110000000
//	//因此大于char类型中超过128的运算都会由于整形提升而输出不符合数学加减运算的结果
//	
//	
//	char a = 4;
//	//00000100-4 ,char只占一个字节 也就是八个bit
//	char b = 125;
//	//01111101-111
//
//	//a和b如何相加
//	// 整形提升
//	//000000000000000000000100
//	//000000000000000001111101
//	//相加之后
//	//000000000000000010000001
//	//将计算完的数据放入变量c
//	//放入c中的值为：10000001
//	char c = a + b;
//	//打印方式为%d 而c为char类型 要进行整形提升
//	//111111111111111110000001-补码
//	//原码取反加一得到补码 在从补码到原码中要反过来
//	//111111111111111110000000-反码
//	//100000000000000001111111-原码 
//	//-127
//	printf("%d\n",c);
//}

//整形提升案例-1
int main()
{
	char a = 0xb6;//使用char类型保存0xb6（十六进制数）为10110110可以放在char内
	short b = 0xb6000;//1011011000000000
	int c = 0xb6000000;
	if (a == 0xb6)//比较也是运算要进行整形提升
	{
		printf("a\n");
	}
	if (b == 0xb6000);//problem
	{
		printf("b\n");
	}
	if (c == 0xb6000000);
	{
		printf("c\n");
	}
}

//案例2
//int main()
//{
//	char c = 1;
//	printf("%u\n",sizeof(c));
//	printf("%u\n", sizeof(+c));//+c整形是运算 要整形提升
//	printf("%u\n", sizeof(!c));
//
//}
//隐式转换的第二种方式——算数运算
//操作符的各个操作数属于不同类型，要先将一个数据类型转换成另一个数据类型 







